Show / Hide Table of Contents
Class PatchSupport
Representation of patch support in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
PatchDevice
PatchSupport
Inherited Members
 PatchDevice.GeomId
 PatchDevice.MasterComponent
 PatchDevice.MasterPoint
 PatchDevice.Position
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(PatchDevice))]
public class PatchSupport : PatchDevice
Constructors
Improve this Doc   View Source
PatchSupport()
Constructor
Declaration
public PatchSupport()
 Improve this Doc
 View Source